[
{"type":"header","version":"5.1.0","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"boothcaai1"},
{"type":"table","name":"movies_1","database":"boothcaai1","data":
[
{"s_no":"1","raw_data_id":"6","link":"http:\/\/www.imdb.com\/title\/tt0100680","txt_file_id":"6_10","rating":"10","review":"Fair drama\/love story movie that focuses on the lives of blue collar people finding new life thru new love.The acting here is good but the film fails in cinematography,screenplay,directing and editing.The story\/script is only average at best.This film will be enjoyed by Fonda and De Niro fans and by people who love middle age love stories where in the coartship is on a more wiser and cautious level.It would also be interesting for people who are interested on the subject matter regarding illiteracy.......","title":"Stanley & Iris (1990)","mpaa":"PG-13","length":"1h 44min","genre":"Drama, Romance","release_date":"9 February 1990 ","avg_rating":"6.4","review_count":"7210","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.b2a9f7a6-b0cc-d76b-15a4-b876583d2a30?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMzhkYTEyYzItMWU5Ny00NjhiLWFiNmEtM2QwOWVlY2UyZThmXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_UY268_CR11,0,182,268_AL_.jpg","notes":""},
{"s_no":"2","raw_data_id":"28","link":"http:\/\/www.imdb.com\/title\/tt0074223","txt_file_id":"28_10","rating":"10","review":"And here's yet another piece of evidence to claim that we should all worship the Italian giallo and acknowledge it to be the absolute most unique sub genre in horror. Emilio Miraglia's \"The Red Queen Kills Seven Times\" is a totally mesmerizing wholesome of original plotting, stylish production values, enchanting music, great acting talents and inventively gory murder sequences. It's a fabulous giallo (released in the golden year 1972) that belongs in the top-five of every fan of Italian cinema. The storyline doesn't just introduce your average black-gloved & sexually frustrated killer, but blends good old-fashioned revenge motives with the macabre myth of the murderous \"Red Queen\". At young age, their grandfather tells the constantly fighting siblings Kitty and Evelyn about an uncanny lady who, once every 100 years on April 6th, kills seven people of which her sister is the inevitable last victim. Fourteen years later, Kitty has become the successful choreographer of a prominent modeling agency (even sharing her bed with the general manager) when suddenly the killing spree begins. Sister Evelyn would be the obvious culprit, but she moved to the States recently... Or has she? Complex yet compelling and involving red herrings are thrown at you every couple of minutes and the Red Queen character is definitely the most fascinating killer in giallo-history. Her face can never be seen, but she wears a blood red cloak and produces the most ghastly laugh whenever she made a new victim. She's not exactly gentle either, as her victims are barbarically stabbed with a dagger, dragged behind cars and even impaled on fences! That latter one is truly one of the greatest (= most gruesome) acts of violence I've ever seen! What more could you possibly request? Some classy and tasteful nudity, perhaps? The gorgeous female actresses got this more than covered, among them Barbara Bouchet and a young Sybil Danning. Emilio Miraglia isn't the most famous giallo-director, as he only made this one and the equally recommended \"The Night Evelyn Came Out of the Grave\", but his influence and importance should NOT be forgotten.","title":"The Red Queen Kills Seven Times (1972)","mpaa":"G","length":"1h 39min","genre":"Crime, Horror, Mystery","release_date":"17 October 1975 ","avg_rating":"6.6","review_count":"2246","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.96acddb6-449b-11d6-ec85-feab6d1a9c51?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZTNkNTE1ZTktYzg0Ny00N2RjLWI1NTgtYTc1M2FmZjdiNDMyXkEyXkFqcGdeQXVyMjIyNjE2NA@@._V1_UY268_CR15,0,182,268_AL_.jpg","notes":""},
{"s_no":"3","raw_data_id":"104","link":"http:\/\/www.imdb.com\/title\/tt0479948","txt_file_id":"104_10","rating":"10","review":"This movie had an interesting cast, it mat not have had an a list cast but the actors that were in this film did a good job. Im glad we have b grade movies like this one, the story is basic the actors are basic and so is the way they execute it, you don't need a million dollar budget to make a film just a mix of b list ordinary actors and a basic plot. I like the way they had the street to themselves and that there was no one else around and also what i though was interesting is that they didn't close down a café to set there gear and that they did it all from a police station. Arnold vosloo and Michael madsen did a great job at portraying there roles in the hostage situation. This was a great film and i hope to see more like it in the near future.","title":"Living & Dying (2007)","mpaa":"R","length":"1h 30min","genre":"Action, Crime, Thriller","release_date":"30 March 2007 (T","avg_rating":"3.9","review_count":"1818","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.92b1ca16-4b43-e46d-2277-df2958408734?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjA3MzAxNTU3NF5BMl5BanBnXkFtZTcwMjM2MjQ0MQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"4","raw_data_id":"138","link":"http:\/\/www.imdb.com\/title\/tt0114366","txt_file_id":"138_7","rating":"7","review":"I don't understand why the other comments focus on McConaughey. He has never been a very interesting film actor. The best part of this movie is the writing and the wit. Alfred Molina and Patrick McGaw make an unusual comic duo, definitely not stock types. Although one can't say their characters are well developed that doesn't make them any less funny.The version I saw was on HDNET and had subtitles for the Spanish dialog, so that was certainly not a problem. The use of Spanish gives it more authenticity. A very underrated movie, judging by the unusually low score IMDb members have given it. I thought it was fun and interesting and worth a 7 at least. A lot of slick movies with higher scores and making big money at the box office are much less interesting.","title":"Scorpion Spring (1995)","mpaa":"R","length":"1h 30min","genre":"Crime, Thriller","release_date":"20 October 1995 ","avg_rating":"4.3","review_count":"268","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.46a9f76a-8834-0934-d1da-38703f011cbf?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTgyNjU5NzQxM15BMl5BanBnXkFtZTcwMDgwMjYzMQ@@._V1_UY268_CR4,0,182,268_AL_.jpg","notes":""},
{"s_no":"5","raw_data_id":"166","link":"http:\/\/www.imdb.com\/title\/tt0021778","txt_file_id":"166_7","rating":"7","review":"This was the first movie that Joan Crawford and Clark Gable made together and they would go on to make several more. Crawford stars a young rich girl who's father is wiped out in the stock market crash and there is nothing left for her and her brother. They have never worked before and the brother, William Bakewell, gets a job with Gable, who is a gangster and Bakewell thinks it will be an easy job but gets in over his head pretty quick. Crawford becomes a reporter at a newspaper but wants to work on the big stories but is given worthless stuff to work on. Their is a massacre in which several of Gable's men are killed and Crawford was a witness to the whole thing. It's a good movie but not one of their best.","title":"Dance, Fools, Dance (1931)","mpaa":"Approved","length":"1h 20min","genre":"Crime, Drama, Romance","release_date":"7 February 1931 ","avg_rating":"6.2","review_count":"824","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.28aebd68-5ac8-c4ba-412e-90b02524214f?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMGUwOTJkYTctNjVkMi00MjM4LWIyODAtNzM4MjQ0ZTNmMzhlXkEyXkFqcGdeQXVyNjc0MzMzNjA@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"6","raw_data_id":"173","link":"http:\/\/www.imdb.com\/title\/tt0087951","txt_file_id":"173_7","rating":"7","review":"Actually, Goldie Hawn is from Washington (Takoma Park, Maryland), but I digress. This is sort of a Mr. Smith goes to Washington type of movie, with some variations but the same premise. I taped this movie off of cable years ago because I had a huge crush on Goldie Hawn. The story is interesting, but it's highly unlikely that some cocktail waitress will get an important job in the government just because she saved some big shot's life. It made me laugh and made me mad at the same time. It made me laugh because some of the situations she found herself in were so ridiculous, I had to laugh. (POSSIBLE SPOILER AHEAD). It made me mad to think that our government would set up an average citizen in the manner she was set up. And the speech she made at the end...beautiful. Too bad not many people have guts like that in real life.","title":"Protocol (1984)","mpaa":"PG","length":"1h 36min","genre":"Comedy","release_date":"21 December 1984","avg_rating":"5.6","review_count":"4520","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.4ca9f75e-f16b-3353-dbb9-71724b3d56cd?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTIzZWVkNTgtMmRiZS00MjYzLWFhNDItZTkyNGU5M2Q5MjM0XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"7","raw_data_id":"203","link":"http:\/\/www.imdb.com\/title\/tt0073766","txt_file_id":"203_7","rating":"7","review":"The Neil Simon's Sunshine Boys starring Walter Matthau and George Burns is a funny comedy on the strange bond to the life and its shortness, but the laughter always bitter taste. Seeing Willy Clark(Matthau) and Al Lewis(Burns) two big theatrical comedy actors now reduced on the imbecility from the hard and unceasing old age you can feel only anger and blue. Willy not ever surrender and continue to look work, while Al is tired for players and he is retired to the country in the house to his daughter. The couple in his old time was truly funny and harmony, but out the scene was a continue squabble and to quarrel, and for eleven years after their broken they not talk between. Now if they would work, they must return together another time for do one of his best old sketch for a comedy story TV show. The meets is explosive and liberating for the old questions. The Neil Simon's screenplay give a certain corrosive spirit to the story and the melancholy and blue overwhelming the many gags and laughter succeeded to generate a good mix also thanks to a great couple Walter Matthu(Nomination Academy Award as Best Actor) and George Burns(Won the Academy Award as Best Support Actor). The two actors are very believable and real and the their harmony seems almost as they real work together for all that time and that realty they not bear between them. The movie is very touching also for its all consuming reality as the story is narrate and how the report Love-Heat that bind the two actors is totally real part to the strange but at the same time ordinarily comprehensible things to the life. My rate is 7.","title":"The Sunshine Boys (1975)","mpaa":"PG","length":"1h 51min","genre":"Comedy","release_date":"8 January 1976 (","avg_rating":"7.1","review_count":"5690","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.2aa9f7bb-328d-30ed-8674-62fb4a7be418?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDIzMWQ0ZGYtZjI5Mi00N2U2LWExYWEtNTNmYTBlNTQ4Yjg0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"8","raw_data_id":"338","link":"http:\/\/www.imdb.com\/title\/tt0206187","txt_file_id":"338_10","rating":"10","review":"I saw this film at Amsterdam's International Documentary Film Festival and was privileged to meet both the directors and Tobias Schneebaum, all of whom are lively and outspoken New Yorkers. The film's title in Amsterdam was Keep the River on Your Right, making the sensational aspect of cannibalism somewhat less prominent. Equally important was the loving - and gay - relationship Tobias Schneebaum had with members of the groups he studied as an anthropologist. His reunion at nearly 80 years of age and inevitable leave-taking were very moving. I can only highly recommend this film to anyone looking for a moving story that is anything but pedestrian.","title":"Keep the River on Your Right: A Modern Cannibal Tale (2000)","mpaa":"R","length":"1h 33min","genre":"Documentary, Adventure, Romance","release_date":"15 April 2000 (U","avg_rating":"6.7","review_count":"797","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.3ca9f75c-74e4-d86e-9e1b-0fa567c6c848?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTYzNDIyMzk2NF5BMl5BanBnXkFtZTcwNTc3MTYxMQ@@._V1_UY268_CR6,0,182,268_AL_.jpg","notes":""},
{"s_no":"9","raw_data_id":"341","link":"http:\/\/www.imdb.com\/title\/tt0242998","txt_file_id":"341_10","rating":"10","review":"I really enjoyed this thriller! I wanted to see it again as soon as it was over. The cast was excellent, the plot was suspenseful and entertaining, and it was just an overall enjoyable movie! I would rate this as one of the best thrillers I've ever seen! The girls in it were really cute also, especially Denise Richards. She was very ornery throughout the movie and gave her character some OOMPH!","title":"Valentine (2001)","mpaa":"R","length":"1h 36min","genre":"Horror, Mystery, Thriller","release_date":"2 February 2001 ","avg_rating":"4.9","review_count":"25877","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.b6a9f744-30c0-8733-e1ad-1e1cd460764f?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZWQxM2JjNTktYWE4Ni00YmZiLWFlNDEtMWYzMmI4N2NhYjk4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"10","raw_data_id":"356","link":"http:\/\/www.imdb.com\/title\/tt0400944","txt_file_id":"356_10","rating":"10","review":"Turned out to be a classy production with what must have been a low budget. The variety of characters is amazing, from axe-wielding dwarfs to 7ft ghouls! I enjoyed the relationship between the leads, not overly sentimental but romantic enough to keep the interest going. I also enjoyed the mix of humour (which can be very easy to get wrong, too much\/not enough) which meant it didn't get too dark, nor too spoofy. It was a great step up from Eaves' other efforts, Hellbreeder and Sanitarium, in terms of storyline and production. They have a great website which is worth checking out. Can't wait for Bane, if the level of improvement continues, it should be fantastic.","title":"The Witches Hammer (2006)","mpaa":"R","length":"1h 31min","genre":"Action, Horror","release_date":"22 December 2006","avg_rating":"3.5","review_count":"321","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.20afad67-4391-a8c3-acf4-c51462124d8b?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTczMDA2MDIxOV5BMl5BanBnXkFtZTgwNDEyMDA2MDE@._V1_UY268_CR9,0,182,268_AL_.jpg","notes":""},
{"s_no":"11","raw_data_id":"428","link":"http:\/\/www.imdb.com\/title\/tt0101811","txt_file_id":"428_7","rating":"7","review":"Two women, sick of their controlling husbands, taking a vacation in Italy for a month with two other very different women.They come back refreshed and energized in this wonderful little film by Merchant - Ivory.Great scenery and the location isn't bad either. Seriously, a very good period piece 7 of 10","title":"Enchanted April (1991)","mpaa":"PG","length":"1h 35min","genre":"Drama","release_date":"25 December 1992","avg_rating":"7.4","review_count":"6103","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.d0a9f7b5-31d1-9c10-9a05-0329436ca344?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjJjYzk2OTktN2UwYS00MTg0LThjMzEtZWY1N2IxMzdjNmM0XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"12","raw_data_id":"595","link":"http:\/\/www.imdb.com\/title\/tt0092527","txt_file_id":"595_9","rating":"9","review":"When John Wayne filmed his Alamo story he had built a complete Alamo set in the town of Brackettsville, Texas which is still there and quite the tourist attraction. As long as that stands, we will have a set for future Alamo interpretations for the screen. One such with Dennis Quaid and Billy Bob Thornton was done in this century.But I would say The Alamo: Thirteen Days To Glory is the best Alamo story filmed I've seen. John Wayne's film is a good one if over-hyped, but it's a John Wayne film with the story redone to fill parameters of screen character of John Wayne. Brian Keith plays Davy Crockett here and gives a fine interpretation of the rollicking frontier character he was.It's a lot closer to Professor Lon Tinkle's book on The Alamo than the Wayne film was and having read the book years ago I can attest to that. Tinkle's book is listed as the source in both films, but Tinkle who was alive back then when the Wayne film was done and he was not pleased with the result.Alec Baldwin was around the right age for young William Barrett Travis, the idealistic freedom fighter who incidentally was a slave owner. Back in the day no one saw the ironic contradiction in that. One thing that was not explored and hasn't been was Travis's hyperactive sex drive. He was the Casanova of the Southwest, he even kept a salacious diary of his libidinal conquests.But the man who always gets the whitewash is Jim Bowie, played here by James Arness. He was a hero at the Alamo to be sure, but his career before the Alamo was that of a scoundrel. He was a smuggler, a slave trader, an all around con man selling land he had questionable title to. But his heroic death certainly redeemed him. No hint of that is in Arness's portrayal nor any others I've seen of Bowie on the screen. And of course he did design the Bowie knife, done to his specifications. That man needed such a weapon.However the main asset that The Alamo: Thirteen Days To Glory has is a full blown portrayal of Antonio De Lopez De Santa Anna, the president of Mexico who comes up personally to put down the rebellion stirred up by the North Americans who've come to","title":"The Alamo: Thirteen Days to Glory (1987)","mpaa":"Not Rated","length":"2h 20min","genre":"Action, Adventure, Biography","release_date":"TV Movie 26 Janu","avg_rating":"6.1","review_count":"554","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.f0a9f6fb-e142-37ae-4f9d-1d62750de85e?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMzYzNzA4MzYwNF5BMl5BanBnXkFtZTgwODI1ODk1MDE@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"13","raw_data_id":"779","link":"http:\/\/www.imdb.com\/title\/tt0849425","txt_file_id":"779_10","rating":"10","review":"In Northeastern of Brazil, the father of the twelve years old illiterate Maria (Fernanda Carvalho) sells his daughter to the middle man of a prostitution organization, Tadeu (Chico Dias), to be employed as a housemaid and have a better life. However, the girl is resold to the farmer Lourenço (Otávio Augusto) that deflowers her, and he gives the abused girl to his teenager son to have his first sexual experience. Then she is sent to a brothel in a gold field in Amazonas and explored his owner, the despicable Saraiva (Antonio Calloni). When Maria escapes to Rio de Janeiro expecting a better life, she is explored by the cáften Vera (Darlene Glória).\"Anjos do Sol\" exposes the sad and shameful reality of child prostitution in Brazil through the fate of the girl Maria. Last year I saw \"Lilja 4-ever\" that tells an identical story in the former Soviet Union; therefore this problem does exist in Third World countries. Director and writer Rudi Lagemann presents a great movie exposing the reality but never showing nudity or explicit sexual scenes. It is the debut of the promising Fernanda Carvalho, who has an excellent performance in the role of a scared child fighting for survival. Most of the prostitutes are amateurs, and it is impossible to recognize the famous Darlene Glória so different she is after many plastic surgeries. The bitter and hopeless end of the story is also very realistic. My vote is ten.Title (Brazil): \"Anjos do Sol\" (\"Angels of the Sun\")","title":"Angels of the Sun (2006)","mpaa":"","length":"1h 32min","genre":"Drama","release_date":"18 August 2006 (","avg_rating":"7.1","review_count":"950","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.c8bc0f17-8bf7-6197-d961-ea1cd43e0a69?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDgyMDI1NjItMTI5Ny00OTQzLWE4MTgtMGIxMDVhNDQxY2NkXkEyXkFqcGdeQXVyMTY2MzYyNzA@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"14","raw_data_id":"896","link":"http:\/\/www.imdb.com\/title\/tt0494290","txt_file_id":"896_10","rating":"10","review":"Once in a while, you come upon a movie that defines your values and shows you the true depth of human emotions leaving you drained. Vivah is just that  maybe more. After watching DDLJ, Saajan, and Lamhey, I really thought that Bollywood has reached its pinnacle and will never come up with anything like that - EVER. Boy was I wrong! I went to the store to buy some groceries and decided to pick this movie up along with the new \"DON\" (just so I can compare The Great AB with ShahRukh  although the decision is already made in my mind). After debating whether I should waste almost 3 hours on a meaningless movie I decided to watch it realizing I had nothing else to do. When I saw the rating of U instead of an A, I was happy that at least it is something where I don't have to watch scantily clad women with bad acting skills doing nothing but dancing on every opportunity they get and making out with every guy to show that they have more skills in bed than a Hollywood B actress. For the first 5 minutes or so I thought I would again be subjected to meaningless story with bad acting. After all everyone who has seen Shahid Kapor know that he as never gained his fame as an accomplished actor. Boy  was I wrong about this movie. This movie grabbed my interest after the first 5 minutes and would never let it go. It was a great movie with a good storyline about the vanishing traditions of our society. I liked not only that the director was brave enough to make a movie where younger generation might not relate to the concept (of arranged marriage), but also that he did it with a conviction (that it is the right thing to do). I have no idea why some people think that the acting was not good. I felt that the acting was great and even though the music score might not be considered the best ever, it was still very very good. The good thing is this music will grow on people with time like it did with me after the I watched that movie a second time. The other good thing is that thee songs are not pushed into the script as we have all seen in so many movies. These songs actually tell a big part of the story and are cert","title":"Vivah (2006)","mpaa":"Not Rated","length":"2h 40min","genre":"Drama, Musical, Romance","release_date":"10 November 2006","avg_rating":"6.6","review_count":"9116","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.f0b3fbc1-6730-e7c4-97d1-3b1a561c28e0?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjNjZWViNTYtYzAzZC00OTY2LWIzMTMtNTcxNzQzNzNiYjc4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"15","raw_data_id":"980","link":"http:\/\/www.imdb.com\/title\/tt0043013","txt_file_id":"980_7","rating":"7","review":"The summary line above, spoken by James Cloud (Robert Preston) to his brother Tom (Robert Sterling) just about says it all. Jim, AKA Kid Wichita, has a way of making things happen, only trouble is, he usually leaves dead bodies where he's been. Not the sort of mentoring Tom envisions for younger brother Jeff, who likes what he sees in Jim, especially when defending their ranch against local Texas cattlemen.The opening credits state 'Introducing John Barrymore Jr. as the Younger Brother', in this his very first screen appearance. That seemed rather odd to me, particularly since he was addressed as Jeff almost immediately into the story. Approximately eighteen at the time of this movie, he bears a passing resemblance to Sean Penn. No stranger to personal and legal problems throughout his career as well as estrangement from his family, I was left wondering if his daughter Drew Barrymore might have ever seen this picture. I'm inclined to think not.On the subject of resemblances, I was also struck by the thought that the young Robert Sterling looked a bit like Roy Rogers early in his career. Knowing Sterling previously only from his role as George Kerby in the early 1950's TV series 'Topper', I thought he looked out of place in a Western, but that might just be me. His character becomes emboldened by his brother's resourcefulness at creating trouble, and provides some of the edginess to this not so typical story. Minor subplots abound, including the relationship rancher John Gall (John Litel) has with his son the Sheriff (who Kid Wichita kills), and the troubled marriage between Kathleen Boyce (Cathy Downs) and her husband Earl (who Kid Wichita kills). Chill Wills rounds out the main cast as one of Tom Cloud's hired hands, and figures in the somewhat predictable finale.What's not quite predictable is how things eventually wind up there, and for that reason, this Western earns points for following a less traveled, hence not quite as formulaic a plot as a lot of good brother\/bad brother Westerns do. Combined with the eclectic casting of the principals, it's one I'd recommend, even if you have to endure s","title":"The Sundowners (1950)","mpaa":"Approved","length":"1h 23min","genre":"Western","release_date":"2 February 1950 ","avg_rating":"5.6","review_count":"419","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.1aa9f6f9-0321-6eb1-ed66-9f5356edc086?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNGM2OTNhNGQtZTI5OC00YjIzLWI5MDAtZmZmZmYyMzkyNjc2XkEyXkFqcGdeQXVyNjgzNDU2ODI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"16","raw_data_id":"984","link":"http:\/\/www.imdb.com\/title\/tt0211938","txt_file_id":"984_7","rating":"7","review":"I happened across \"Bait\" on cable one night just as it started and thought, \"Eh, why not?\" I'm glad I gave it a chance. \"Bait\" ain't perfect. It suffers from unnecessarily flashy direction and occasional dumbness. But overall, this movie worked. All the elements aligned just right, and they pulled off what otherwise could have been a pretty ugly film. Most of that, I think, is due to Jamie Foxx. I don't know who tagged Foxx for the lead, but whoever it was did this movie a big favor. Believable and amazingly likeable, Foxx glides through the movie, smooth as butter and funnier than hell. You can tell he's working on instinct, and instinct doesn't fail him.The plot, while unimportant, actually ties together pretty well, and there's even a character arc through which Foxx's character grows as a person. Again, they could've slipped by without any of this, but it just makes things that much better.I'm surprised at the low rating for this. Maybe I just caught this move on the right night, or vice versa, but I'd give it a 7\/10. Bravo, Mssr. Foxx.","title":"Bait (2000)","mpaa":"R","length":"1h 59min","genre":"Action, Comedy, Crime","release_date":"15 September 200","avg_rating":"5.8","review_count":"10644","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.caa9f747-8143-ee4b-f0d2-79b8948e0423?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTc2NzM2MjY1OV5BMl5BanBnXkFtZTYwMTkyNjc3._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"17","raw_data_id":"1033","link":"http:\/\/www.imdb.com\/title\/tt0036515","txt_file_id":"1033_10","rating":"10","review":"Say what you will about schmaltz. One beauty of this film is that it is not pro-American. It is a morality about some Americans being called to high purpose and how they rose to the occasion. It is inspiring because it is about people of noble purpose.To me, the most interesting part of the film is the education of Fanny and David Farrelly (Bette Davis' mother and brother). As Fanny says, \"We've been shaken out of the magnolias.\"In today's political climate where, led by a president who shamelessly lied to us and used 9\/11 to bring out the absolute worst characteristics of human beings, we sunk to the level of the 9\/11 murderers to seek blood-thirsty vengeance. It can't all be blamed on Mr. Bush - after all, we allowed him to lead us in that direction and even re-elected him after his lies had been exposed. Now, with complete justification, we Americans are reviled throughout the world.Today, we watch this film with a new awareness: That the rise to power of Nazis in Germany was not due to a flaw in the German character, but, a flaw in human beings that allows us to rationalize anything that will justify our committing immoral and heinous acts. I'm not comparing George Bush to Adolph Hitler. But, I am pointing out how a leader can whip us up into a frenzy of terror, hatred, and hyper-nationalism to do despicable things.Sadly, the blackmailer, who will do whatever needs to be done for his own agrandizement, no matter how immoral, is most like the leaders of our country, those who support them, and those who have buried their heads so deep in the sand, that they can't even be bothered to vote.A film like Watch on the Rhine reminds us of what we once aspired to be - a force for the betterment of humanity - and that we have it in us to once again aspire to lofty goals.","title":"Watch on the Rhine (1943)","mpaa":"Approved","length":"1h 54min","genre":"Drama, Thriller","release_date":"27 August 1943 (","avg_rating":"7.3","review_count":"3925","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.4ea9f78d-264c-fbe8-4961-f3191a3fcff7?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BM2ZmMDhjNmQtN2MxNy00MTdmLTg4MTEtZTVkMTFmZDg0NTNlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"18","raw_data_id":"1077","link":"http:\/\/www.imdb.com\/title\/tt0040613","txt_file_id":"1077_8","rating":"8","review":"This is comedy as it once was and comparing this with the two remakes, THE MONEY PIT and ARE WE DONE YET?, only points out all the more how the 40's movie makers had a flair for comedy which has since, regretfully, been lost.I was 15 when I first saw this and even at that tender age, there was much I could laugh at. Now of course being familiar with adult frustrations, I see a whole lot that I missed as a youth.The three main actors...Cary Grant, Myrna Loy, and Melvyn Douglas...interacted perfectly, but the core of the movie lies in the frustrations encountered in achieving a dream. It's never as easy and free of unseen complications as one envisions.All in all, this is a classic comedy which still stands above the attempts to remake it.","title":"Mr. Blandings Builds His Dream House (1948)","mpaa":"Approved","length":"1h 34min","genre":"Comedy, Romance","release_date":"4 June 1948 (USA","avg_rating":"7.3","review_count":"10499","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.12aa78a3-e310-1bc2-9697-c674b837e28b?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYWM0ZjU1YTgtOTQ5Zi00MWY5LTk4ZjEtOTE4YWU1Y2RmZjU5L2ltYWdlXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"19","raw_data_id":"1125","link":"http:\/\/www.imdb.com\/title\/tt0076208","txt_file_id":"1125_8","rating":"8","review":"Michael Cacoyannis has had a relatively long career but has surprisingly few credits to his name, including some real duds such as the unfunny cold war satire The Day the Fish Came Out. Iphigenia, however, is a highlight. Adapted by Cacoyannis from the play by Euripides, it's a superior rendering of the classic tragedy and recently made its first television appearance in many years in the United States courtesy the Flix Channel. The film is shot on an epic scale but is decidedly not a 'big' film, with the emphasis placed on the simple story: in supplication to the gods, King Agamemnon (Kostas Kazakos)is compelled to sacrifice his daughter Iphigenia (Tatiana Papamoschou), much to the consternation of Queen Clytemnastrae (Irene Papas). Kazakos and Papas are both outstanding, but it is the stunning Papamoschou who brings the most interesting elements to the screen, blending the innocence of childhood with the dawning realization that she is the pawn in a political game. Strongly recommended for fans of international cinema.","title":"Iphigenia (1977)","mpaa":"Not Rated","length":"2h 7min","genre":"Drama","release_date":"20 November 1977","avg_rating":"7.7","review_count":"1566","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.7eaa7068-7727-f4b9-8edb-af4d93fb9d71?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZmFkZTUwZjktZjFhNi00YzRlLWE5YTctMTdkMTQ1MjJmNTI4L2ltYWdlXkEyXkFqcGdeQXVyMDM0NzcxMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"20","raw_data_id":"1132","link":"http:\/\/www.imdb.com\/title\/tt0102951","txt_file_id":"1132_10","rating":"10","review":"Its Hollywood imitating Daytiem Soap Operas at its finest! Its the fun that we never see. Great characters and great lines. Whoopi is hilarious.....Sally Field is so over the top....Gary Marshalls lines are a riot....this is what I love about good comedies. Never afraid to poke fun at themselves!!!!!!The sets were great....wardrobe was on point and the backstabbing \"Montana Morehead\" was a devilish delight. Terri Hatcher as \"Dr. Monica Demonico\" didn't have enough lines but none the less still gorgeous and fun when on screen. I would love to know how the idea for this movie came up. Never have I seen a cast of people have so much fun in making comedy work! Soapdish is a must have and I am waiting for the DVD!!!","title":"Soapdish (1991)","mpaa":"PG-13","length":"1h 37min","genre":"Comedy, Romance","release_date":"31 May 1991 (USA","avg_rating":"6.6","review_count":"14798","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.d4b81617-36de-4142-7632-d628ceef4bbb?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjc1Y2ZlNDktNmQzOC00ZTA0LThlNTAtMjNlODVmMzA1MzQ4XkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_UY268_CR1,0,182,268_AL_.jpg","notes":""},
{"s_no":"21","raw_data_id":"1185","link":"http:\/\/www.imdb.com\/title\/tt0049432","txt_file_id":"1185_8","rating":"8","review":"Robert Taylor and Stewart Granger switch the goodie-baddie roles they held in \"All the brothers were valiant\". Taylor seems a bit uncomfortable in his bad-guy role but Granger plays his part perfectly. However the real hero in the story are the bison and the northwest. The film is perfectly made, with the atmosphere of the times wonderfully given. The direction is taut and although the film is no light-hearted entertainment it is, to my way of thinking a major film, unjustly ignored by the cognoscenti.","title":"The Last Hunt (1956)","mpaa":"Not Rated","length":"1h 48min","genre":"Drama, Western","release_date":"19 April 1956 (U","avg_rating":"6.9","review_count":"1404","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.d0a9f7a1-144e-097c-d466-505795541337?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZTQyM2U3MTUtNDc1OC00Zjc1LTg3MTUtNmNhZmFiYzY5ODhjXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"22","raw_data_id":"1207","link":"http:\/\/www.imdb.com\/title\/tt0090799","txt_file_id":"1207_10","rating":"10","review":"Still love it 17 or so years after the first time I saw it, in fact I discovered that I had lost my copy of this and was very upset. Despite it's non-association with the original (which as a kid I never noticed and as an adult I don't care about), this is what cartoons *should* be like. Just dark enough to be interesting and light enough to be enjoyed by everyone. I'm more than glad that my parents raised me on this kind of thing rather than the cartoons we see today that teach our kids nothing. The music is great, and gets stuck in your head forever...I have downloaded the entire soundtrack at one point or another.","title":"Care Bears Movie II: A New Generation (1986)","mpaa":"G","length":"1h 16min","genre":"Animation, Adventure, Comedy","release_date":"21 March 1986 (U","avg_rating":"5.5","review_count":"2155","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.5ea9f737-5842-6444-6824-6c7453336736?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOGEzMWNiY2YtZTE0Ni00OGVlLWIzMGQtYWZkNzAyYTI4ZmY0XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"23","raw_data_id":"1279","link":"http:\/\/www.imdb.com\/title\/tt0161743","txt_file_id":"1279_9","rating":"9","review":"This movie is an amusing and utterly sarcastic view of pop culture and the producers thereof. I was impressed with the photography that consisted of vivid colors and spin doctored settings, especially when you think that this is Zukovic's first large scale attempt.One warning, do not take the movie's message that seriously. It is not for mass consumption ( and that is not a compliment). The message is a somewhat stylized post-college, neophyte view of society.I did enjoy the basic plot line of a fictitious 'zine editor verbally whipping the mobocracy of the 90's.","title":"The Last Big Thing (1996)","mpaa":"R","length":"1h 38min","genre":"Comedy, Drama","release_date":"23 September 199","avg_rating":"6.8","review_count":"369","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.1aa9f71f-9393-3b8d-233c-7f7dba56a499?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTQyMjAwODg1OV5BMl5BanBnXkFtZTcwNDY3NDk2Mg@@._V1_UY268_CR4,0,182,268_AL_.jpg","notes":""},
{"s_no":"24","raw_data_id":"1289","link":"http:\/\/www.imdb.com\/title\/tt0109287","txt_file_id":"1289_7","rating":"7","review":"First of all the movie, is an ingenious work of art(movie). The plot was filled with surprises, a little kid pretends to be a grown up inherits one million dollars and how he spends it. I mean how whacked out is this. Walt Disney really outdid themselves this time. The comedy is most of the times expected but the other times unexpected. I mean was this movie OK or was this movie OK. It also teaches a lot about wise youths and I this kid is really wise and a bit time smart pants. But also it sucks. How the heck could a guy like that kid get a hot police babe and his dad let him go free. That's like let a killer get bailed free for ten years. If I were to do that I'd get beaten with a 'suble jack'(a huge stick that stings when used to bench your butts really hard). That kid is really lucky. Back to the story. The movie makers really knew what they were doing when they made this movie but still it's not perfect. The acting was good and bad. The kid and woman had no chemistry neither did the father but the bros were excellent'. The special effects on the other hand was lame. Plus this movie isn't based on reality. I hated and loved it at the same time.","title":"Blank Check (1994)","mpaa":"PG","length":"1h 33min","genre":"Comedy, Crime, Family","release_date":"11 February 1994","avg_rating":"5.3","review_count":"19269","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.60a9f702-8a25-7146-4f1a-34323975ccac?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNWM4M2QwOWUtNGMwMS00Nzg2LTg0YjktYTU4M2ZhYTMwYTU5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"25","raw_data_id":"1334","link":"http:\/\/www.imdb.com\/title\/tt0256692","txt_file_id":"1334_8","rating":"8","review":"This film is a very good movie.The way how the everybody portrayed their roles was great.The story is nice.It tells us about Raj who is in love with Priya.They get married.She later becomes pregnant.But shortly their is a problem.Sadly they wont get the child.Raj later meets Madhu.He bribes her.She later becomes pregnant but she is not married to him.The movie is very good.The dialogues are wonderful.The songs are melodious to listen.The picturisations are good.The wedding song is very colourful.Salman,Rani,Preity were excellent. .The cinematography is excellent.The film is beautifully pictured in Swiztertland.The cast makes the movie great to watch.Worth the money and time.. Rating-8\/10","title":"Chori Chori Chupke Chupke (2001)","mpaa":"","length":"2h 40min","genre":"Comedy, Drama, Musical","release_date":"9 March 2001 (In","avg_rating":"5.4","review_count":"4292","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.f8b5cf56-30e9-4905-ab9e-9a6e96518bad?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYWU3YzY4OGMtNTYwMi00OTVmLWFlMzUtNmM2M2M3NmUyZTM1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_UY268_CR2,0,182,268_AL_.jpg","notes":""},
{"s_no":"26","raw_data_id":"1434","link":"http:\/\/www.imdb.com\/title\/tt0115907","txt_file_id":"1434_10","rating":"10","review":"Kept my attention from start to finish. Great performances added to this tremendous film. Mr. Pacino once again gives us another brilliant character to enjoy.","title":"City Hall (1996)","mpaa":"R","length":"1h 51min","genre":"Drama, Thriller","release_date":"16 February 1996","avg_rating":"6.2","review_count":"19666","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.6ca9f706-ecbd-d0e2-0e7f-23ec6cc0fd75?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDlhNDc3MmEtODJkMS00YmVlLWI4MTUtNDRkMTFhYjk1NDdlXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"27","raw_data_id":"1495","link":"http:\/\/www.imdb.com\/title\/tt0065854","txt_file_id":"1495_9","rating":"9","review":"This is an awesome Amicus horror anthology, with 3 great stories, and fantastic performances!, only the last story disappoints. All the characters are awesome, and the film is quite chilling and suspenseful, plus Peter Cushing and Christopher Lee are simply amazing in this!. It's very underrated and my favorite story has to be the 3rd one \"Sweets To The Sweet\", plus all the characters are very likable. Some of it's predictable, and the last story was incredibly disappointing and rather bland!, however the ending was really cool!. This is an awesome Amicus horror anthology, with 3 great stories, and fantastic performances, only the last story disappoints!, i say it's must see!.1st Story (\"Method for Murder\"). This is an awesome story, with plenty of suspense, and the killer Dominic is really creepy, and it's very well acted as well!. This was the perfect way to start off with a story, and for the most part it's unpredictable, plus the double twist ending is shocking, and quite creepy!. Grade A2nd Story. (\"Waxworks\"). This is a solid story all around, with wonderful performances, however the ending is quite predictable, but it's still creepy, and has quite a bit of suspense, Peter Cushing did an amazing job, and i couldn't believe how young Joss Ackland was, i really enjoyed this story!. Grade B3rd Story (\"Sweets to the Sweet\"). This is the Best story here, as it's extremely creepy, and unpredictable throughout, it also has a nice twist as well!. Christopher Lee did an amazing job, and Chloe Franks did a wonderful job as the young daughter, plus the ending is quite shocking!. I don't want to spoil it for you, but it's one of the best horror stories i have seen!. Grade A+4th Story (\"The Cloak\"). This is a terrible story that's really weak and unfunny Jon Pertwee annoyed me, however the ending surprised me a little bit, and Ingrid Pitt was great as always, however it's just dull, and has been done before many times, plus where was the creativity??. Grade DThe Direction is great!. Peter Duffell does a great job here, with awesome camera work, great angles, adding some creepy atmosphere, and keeping the","title":"The House That Dripped Blood (1971)","mpaa":"PG","length":"1h 42min","genre":"Horror","release_date":"2 April 1971 (US","avg_rating":"6.6","review_count":"5589","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.fcb15613-eb48-1eff-6070-9ba2fe5df29e?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDA0YTEyMDUtNzNiNi00OWIwLThlMWItZTNjZGRjZWZkOTk1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"28","raw_data_id":"1524","link":"http:\/\/www.imdb.com\/title\/tt0050928","txt_file_id":"1524_7","rating":"7","review":"This movie is a should-be classic. It's not perfect, certainly. The pacing, while perfect for the stage, is in movie form slow as a tortoise with arthritic knees. Jean Seberg is misdirected to be too sweet and too gentle. She fully shows enough acting talent, skill, and craft to convincingly play the clever, passionate, and confident Joan, but, unfortunately, the director missed the point of the character. George Bernard Shaw is my favorite playwright. In no other play has his dialog been more sharp, nor the lines more musical. However, processing this film requires that you look at it as a lawyer. This movie is a case, and the viewer is the judge. That is how this picture is to be enjoyed. 7\/10.","title":"Saint Joan (1957)","mpaa":"Not Rated","length":"1h 50min","genre":"Biography, Drama, History","release_date":"8 May 1957 (USA)","avg_rating":"6.4","review_count":"1115","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.aea9f76b-023f-dd0e-f765-40366861501e?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOWQwNjM3ZmItYjA4Yy00MWIwLTk5YTAtNGVmOTdkZWQ4NGI2XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"29","raw_data_id":"1597","link":"http:\/\/www.imdb.com\/title\/tt0093565","txt_file_id":"1597_8","rating":"8","review":"This is the kind of film for a snowy Sunday afternoon when the rest of the world can go ahead with its own business as you descend into a big arm-chair and mellow for a couple of hours. Wonderful performances from Cher and Nicolas Cage (as always) gently row the plot along. There are no rapids to cross, no dangerous waters, just a warm and witty paddle through New York life at its best. A family film in every sense and one that deserves the praise it received.","title":"Moonstruck (1987)","mpaa":"PG","length":"1h 42min","genre":"Comedy, Drama, Romance","release_date":"15 January 1988 ","avg_rating":"7.1","review_count":"51156","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.3cb331ed-baf1-4ed0-bd6a-414544e79365?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjIwMDY0NzYyMF5BMl5BanBnXkFtZTcwOTE5NDk0NA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"30","raw_data_id":"1629","link":"http:\/\/www.imdb.com\/title\/tt0081695","txt_file_id":"1629_10","rating":"10","review":"This movie is so cheap, it's endearing!!! With Ron Liebmann (Major Vaughn) providing the most entertaining on-screen diatribes in film history. I own 2 copies of this movie on video...on one, Ralph Macchio is caught actually cracking up in the background at Major Vaugn while he is ranting at \"Hash\". Obviously they forgot to edit this mistake out of the film, but it goes to show just how funny the movie is, when the actors themselves can't keep a straight face!!!","title":"Up the Academy (1980)","mpaa":"R","length":"1h 27min","genre":"Comedy","release_date":"6 June 1980 (USA","avg_rating":"4.9","review_count":"1570","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.b6a9f736-93d7-fa4d-2a80-b99c47f83cfd?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjNkY2RiMDItYmRlMS00MzYyLWJmZGMtYWVhYjViODcyMjNiXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"31","raw_data_id":"1686","link":"http:\/\/www.imdb.com\/title\/tt0100666","txt_file_id":"1686_10","rating":"10","review":"After a long hard week behind the desk making all those dam serious decisions this movie is a great way to relax. Like Wells and the original radio broadcast this movie will take you away to a land of alien humor and sci-fi paraday. 'Captain Zippo died in the great charge of the Buick. He was a brave man.' The Jack Nicholson impressions shine right through that alien face with the dark sun glasses and leather jacket. And always remember to beware of the 'doughnut of death!' Keep in mind the number one rule of this movie - suspension of disbelief - sit back and relax - and 'Prepare to die Earth Scum!' You just have to see it for yourself.","title":"Spaced Invaders (1990)","mpaa":"PG","length":"1h 40min","genre":"Adventure, Comedy, Sci-Fi","release_date":"27 April 1990 (U","avg_rating":"5.4","review_count":"3305","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.a6a9f7af-cdbe-c141-05dd-67edf93a16eb?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNjQyNjRkNWYtYzA5OC00ZGRiLThmYjEtZjJmNzlmZWI2ZDFiXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"32","raw_data_id":"1734","link":"http:\/\/www.imdb.com\/title\/tt0038046","txt_file_id":"1734_7","rating":"7","review":"I just saw this movie for the first time ever and I liked it. Her dancing was very entertaining. I read somewhere that she got the part in this movie because she knew how to dance. The scenery was great too. Yvonne is such a talented woman and beautiful. WE laughed at the silly kissing scenes, but that is what is great about old movies! I grew up with her on The Munsters and I am enjoying watching her in her earlier movies. They may not all be the best out there but still worth watching to see her act and sing. I am slowly purchasing all her movies and watching them as I receive them. I have a large collection of her memorabilia.","title":"Salome, Where She Danced (1945)","mpaa":"Approved","length":"1h 30min","genre":"Adventure, Drama, Music","release_date":"17 April 1945 (U","avg_rating":"5.6","review_count":"246","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.c4a9f7a1-bdbf-91b0-50e2-622943696f52?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNjlhZDBhOGItZTA1Mi00YmRmLWI1ZDgtYWIzZjJlMDU0ZjFmXkEyXkFqcGdeQXVyMjI3NzYwODc@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"33","raw_data_id":"1737","link":"http:\/\/www.imdb.com\/title\/tt0086379","txt_file_id":"1737_8","rating":"8","review":"I love old Burt Reynolds movies. They're funnier and better than every other movie combined. They might as well have stopped making movies after \"Cannonball Run 2\", but I guess how could they have known that there weren't going to be any more good ones? Man this movie's good. Burt Reynolds has to dress up like a chicken and drive around in a racecar a lot, and the luxuriant Loni Anderson is on hand, looking extremely hot in an eightiesly way. Burt and Loni, those were the days! I used to have this magazine that had Loni Anderson in it advertising for a vaccuum cleaner. I sure loved that advertisement! Plus there's this one part in the movie where the audience at the racetrack is upset at something Stroker Ace (Burty R.) is doing, and it shows one guy in the audience bending over and sticking his finger up his butt to display his disappointment! I laughed so hard I almost passed away into the night! If you can find this movie, rent it! And then never watch another movie again, because I tell you right now: there's no point.","title":"Stroker Ace (1983)","mpaa":"PG","length":"1h 36min","genre":"Action, Comedy, Romance","release_date":"1 July 1983 (USA","avg_rating":"4.9","review_count":"3625","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.a8a9f709-7366-2f1c-252b-6519dbd2adb3?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BN2Y1ODQzYTMtMjYyYy00ZWQwLWI2Y2EtMDk4ZDg3ZTExOTU3XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"34","raw_data_id":"1748","link":"http:\/\/www.imdb.com\/title\/tt0405422","txt_file_id":"1748_8","rating":"8","review":"From the very beginning I was so excited to see this movie. The poster is possibly the funniest I've ever seen for a movie. I immediately bought one for my dorm this September.Every element came together in this movie so beautifully. It's not often you see a movie with so many penis, gay, and racial jokes so praised by critics. Carell and the rest of the cast deliver each raunchy joke sensationally. Carell remains sweet throughout the entire movie where by the end of the movie you're rooting for him to succeed in his relationship more than you are for him to get laid. The supporting cast is brutal, each of them having some problems with the ladies themselves.One of the things about this movie is the abundance of memorable scenes we're given. This is what makes a movie easy to remember fondly. This movie will often be brought up when the words \"chest waxing\" and \"condoms\" are mentioned in conversation.Watching it in the theater I was surprised how many older people were there to watch it. I saw a group of four mid-60s women come in. Despite an older audience, this movie still filled the entire theater with laughter.I think the type of people who will like this are the fans of the Office and Steve Carell. A lot of the jokes remind me of the type of jokes you'd see on Family Guy, too. The movie is shallow enough for adolescent boys and still sweet and clever enough for middle aged women.I don't recommend going to this movie if you aren't a fan of profanity or if you are easily offended. However, when you are at the movie, just remember this movie is all in good humor. The jokes aren't \"gay jokes,\" they're just jokes. And they're funny.","title":"The 40-Year-Old Virgin (2005)","mpaa":"R","length":"1h 56min","genre":"Comedy, Romance","release_date":"19 August 2005 (","avg_rating":"7.1","review_count":"400900","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.caa9f714-5a8d-bf33-00d4-0b77e7ea36de?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTNjYTA1NDMtZGZmZi00MTdiLThjZTMtZWU1MGYyZjZkNzgxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"35","raw_data_id":"1783","link":"http:\/\/www.imdb.com\/title\/tt0765447","txt_file_id":"1783_8","rating":"8","review":"Criticism of the film EVENING, based on the novel by Susan Minot and adapted for the screen by Minot and Michael Cunningham, has been harsh, so harsh that it may have discouraged many viewers from giving the film a try. The primary criticism has centered on the fact that very little happens in this film about a dying woman's fretting over a mistake she made one summer in her youth, that famous actors were given very minor roles, that the entire production was over-hyped, etc. For this viewer, seeing the film on a DVD in the quiet of the home, a very different reaction occurred.Ann Grant Lord (Vanessa Redgrave) is dying in her home by the ocean and her medication and memories allow her to share a man's name - 'Harris' - with her two grown daughters Nina (Toni Colette) and Constance (Natasha Richardson). As her daughters sit at her bedside Ann relives a particular summer when she was a bridesmaid for her best friend Lila (Mamie Gummer) - a marriage both Ann (Claire Danes as the youthful Ann) and Lila's alcoholic brother Buddy (Hugh Dancy) objected to, feeling that Lila was simply marrying a man of her class instead of the boy she had loved - Harris Arden (Patrick Wilson), her housekeeper's son who had become a physician. Harris, Buddy, Lila, and Ann are woven together in a series of infatuations and romances that have been kept secret until now, 50 years later, as Ann is dying. The older Lila (Meryl Streep) visits Ann at the end and the secrets are revealed: 'there are no such things as mistakes - life just goes on.' The film is a delicate mood piece and the script by Minot and Cunningham is rich in atmosphere and subtle life lessons. Yes, there are gaps in the story that could have used more explanation, but in order to maintain the aura of nostalgia of a dying lady's words, such 'holes' are understandable. The film is graced by the presence of not only Redgrave, Richardson (Redgrave's true daughter), Collette, Gummer (Streep's true daughter), Meryl Streep, Claire Danes, Eileen Atkins, Glenn Close, Hugh Dancy and Patrick Wilson, but also with an ensemble cast of brief but very solid performances. T","title":"Evening (2007)","mpaa":"PG-13","length":"1h 57min","genre":"Drama, Romance","release_date":"29 June 2007 (US","avg_rating":"6.5","review_count":"13067","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.52a9f759-febb-8037-a3b7-67ee22b44da0?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTQ3NTAzNzgzMV5BMl5BanBnXkFtZTcwMDIyMjY0MQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"36","raw_data_id":"1878","link":"http:\/\/www.imdb.com\/title\/tt0082031","txt_file_id":"1878_10","rating":"10","review":"Written and directed by Steve Gordon. Running time: 97 minutes. Classified PG.It was the quintessential comedy of the decade. It won Sir John Gielgud the Academy Award. It was even featured in VH1's \"I Love the 80's.\" And it looks just as good today as it did upon it's initial release. Arthur is the acclaimed comedy classic about a drunken millionaire (played with enthusiasm and wit by Dudley Moore in an Oscar-nominated performance) who must choose between the woman he loves and the life he's grown accustomed to. While the basic plot is one big cliche, there's nothing trite about this congenial combination of clever dialogue and hilarious farce. Arthur Bach is essentially nothing more than a pretentious jerk, but you can't help but like him. Especially when he delivers lines such as, \"Don't you wish you were me? I know I do!\" He's also a delineation from the archetypical movie hero: unlike most wealthy characters we see on the silver screen, he's not ashamed of being filthy rich. In one scene, a man asks him, \"What does it feel like to have all that money?,\" to which he responds, \"It feels great.\" Moore lends such charisma and charm to a character that would otherwise be loathed by his audience. And Gielgud is simply perfect as the arrogant servant, addressing his master with extreme condescension in spite of the fact that his salary depends on him. Arthur is one of those movies that doesn't try to be brilliant or particularly exceptional: it just comes naturally. The screenplay -- which also earned a nod from the Academy -- is saturated with authentic laugh-out-loud dialogue. This is the kind of movie that, when together with a bunch of poker buddies, you quote endlessly to one another. It also looks at its characters with sincere empathy. There have been a number of comedies that attempt to dip into drama by including the death or illness of a principal star (including both Grumpy Old Men's), but few can carry it off because we just don't care. When this movie makes the dubious decision to knock off the butler, it actually works, because we genuinely like these people. Why should you see Arthur?","title":"Arthur (1981)","mpaa":"PG","length":"1h 37min","genre":"Comedy, Romance","release_date":"17 July 1981 (US","avg_rating":"6.9","review_count":"26179","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.10a9f7a8-df32-6164-40f5-5744fbe1ab9f?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjc4NGYwYmQtZDgyYi00OTQ1LWJmOTgtNWEwNmY1NjczMzVhXkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"37","raw_data_id":"1930","link":"http:\/\/www.imdb.com\/title\/tt0460721","txt_file_id":"1930_10","rating":"10","review":"This film is hilarious, original, & beautifully directed. I have become a BIG BAD SWIM groupie, tracking it to film festivals whenever & wherever I can. I've seen it about half a dozen times now, & each time, enthusiastic audience response has confirmed my feeling that this is one of the best films to come out in years. At nearly every festival it has screened, it has either sold out, or won the Audience Favorite award. It's clear that people love this film, & even clearer why they do. The cinematography is superb, the characterization & acting brilliant, the ending fantastic, & the direction filled with compassion, wisdom & the art of perfect timing. It's hard to believe this is Ishai Setton's first film. I hope it will be released soon so everyone can see it.","title":"The Big Bad Swim (2006)","mpaa":"","length":"1h 36min","genre":"Comedy, Romance, Sport","release_date":"26 April 2006 (U","avg_rating":"6.2","review_count":"1433","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.90b6e612-491b-d60d-596b-e4c216f9e8be?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTg5OTQyNDE4MV5BMl5BanBnXkFtZTcwMjA1ODI1MQ@@._V1_UY268_CR5,0,182,268_AL_.jpg","notes":""},
{"s_no":"38","raw_data_id":"1977","link":"http:\/\/www.imdb.com\/title\/tt0063385","txt_file_id":"1977_10","rating":"10","review":"I really love this movie. I remember one time when I was in 2nd >grade, my teacher showed it to us on a 16mm film reel. This movie, however, can be a little frightening for 2nd graders such as the scene where Bill murders Nancy and seeing Fagin's face for the first time on the screen. One of my relatives is sick of seeing this movie because she studied over it in music class. If I were a teacher and could grade the people who produced this wonderful film, I would give them an A+.","title":"Oliver! (1968)","mpaa":"G","length":"2h 33min","genre":"Drama, Family, Musical","release_date":"27 September 196","avg_rating":"7.4","review_count":"35375","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.90a9f794-2a59-0782-3422-8bedda2f81ef?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNWQwNTE4NWQtZDg0MC00ZDhkLWIzMzQtNDU1MDIxZTNmM2M3XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"39","raw_data_id":"2003","link":"http:\/\/www.imdb.com\/title\/tt0272147","txt_file_id":"2003_8","rating":"8","review":"The main problem of the first \"Vampires\" movie is that none of the characters were sympathetic. Carpenter learned from his mistake and this time used a likable vampire hunter and a charismatic vampire. The female vampire Una certainly is the coolest vampire since Blade's Deacon Frost. Unfortunately while there are some good concepts like a cool slow motion restaurant scene (why didn't Carpenter use more of this??) this movie is nowhere near as good as it could have been. I expected to see strong vampires in action and at least one longer lasting nicely choreographed fight sequence (for example inside a city) and was left somewhat disappointed. While \"Los Muertos\" proceeds at a faster pace than its predecessor, it still drags a little in some parts (though nowhere near as bad as \"Vampires\" did). Much like \"Vampires\" however this movie's climax near the end is not very intense.Most of the above may sound like \"Los Muertos\" is a bad movie but it definitely isn't. It is generally enjoyable and ranks among the better entries to the genre. It is neither an unoriginal Dracula remake (like almost every other vampire movie out there) nor is it an unintelligent action spectacle like Blade II. It simply could have used a bit more excitement.I'd really like to see a third installment made by Carpenter but it's probably not going to happen.SPOILER WARNING The ending was way too predictable. Una should have gotten away- that would have made the movie quite unusual.","title":"Vampires: Los Muertos (2002)","mpaa":"R","length":"1h 33min","genre":"Action, Horror, Thriller","release_date":"27 June 2003 (Sp","avg_rating":"4.6","review_count":"6984","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.aaa9f7c3-f501-4797-1fed-cbe1730e5b49?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTM0Nzg5NzM3MF5BMl5BanBnXkFtZTcwNTEzMDgxMQ@@._V1_UY268_CR1,0,182,268_AL_.jpg","notes":""},
{"s_no":"40","raw_data_id":"2010","link":"http:\/\/www.imdb.com\/title\/tt0036919","txt_file_id":"2010_8","rating":"8","review":"I thought this movie was pretty good. Some parts were corny but that's understandable since it was made more than 55 years ago. I thought the best performance in the movie was given by Michele Morgan who played Millie convincingly. Jack Haley is also really good as Mike O'Brien. Even though I'm not a big Frank Sinatra fan, I think he was very good in this movie. If your have a craving for a silly, over the top musical comedy, Higher and Higher is the movie for you.","title":"Higher and Higher (1943)","mpaa":"Approved","length":"1h 30min","genre":"Comedy, Musical, Romance","release_date":"December 1943 (U","avg_rating":"6","review_count":"586","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.9eaf3bb1-2e69-3a72-07c3-f210394e6dcc?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMGEwZTkyOGMtNWE5Yi00NmM4LThiMzgtMmQyZjEwYmRkOTI0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTk2MzI2Ng@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"41","raw_data_id":"2029","link":"http:\/\/www.imdb.com\/title\/tt0095993","txt_file_id":"2029_8","rating":"8","review":"As a horse lover one can only appreciate this movie. There are few movies that show horsemanship as this one does. I would love to know if Brian does his own riding in the film. Would also like to know if he enjoys horses. Brian has been in a lot of movies where he has ridden. Where did he learn to ride? The only part that is hard for me to take is that the riding scenes are always full tilt, like a horse can run forever at full steam. The camera-work is first rate and captures the horses in a way that shows how dangerous things can be on top of a horse. It would be very interesting to know how they went about casting this movie to find all of the very good horseback riders.","title":"Return to Snowy River (1988)","mpaa":"PG","length":"1h 39min","genre":"Adventure, Drama, Western","release_date":"15 April 1988 (U","avg_rating":"6.7","review_count":"2337","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.c6a9f732-2ea1-a618-e30e-7257554bf6e1?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOGYxMGE3YmUtN2M5OC00MGExLTk4ZWMtODdmZWU2MjFkZmM4XkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_UY268_CR6,0,182,268_AL_.jpg","notes":""},
{"s_no":"42","raw_data_id":"2036","link":"http:\/\/www.imdb.com\/title\/tt0381966","txt_file_id":"2036_7","rating":"7","review":"- SMALL SPOILER HEREIN! - When I looked at the votes for \"Creep\" today, I was surprised about so many IMDb-users rating this movie \"1\". I am wondering: what do people expect of such kind of movie? Are there so many people watching a movie without knowing anything about it?\"Creep\" is a HORROR movie and it is a pretty good one! This automatically means: it has a absurd story full of holes, outrageous hazards and simple one-side-characters. So why complain about it? Just take some popcorn and coke, make yourself comfortable in your seat and then... ...enjoy to be scared to death! The first 60 minutes when there is almost nothing else than Kate and a lonely subway station are incredibly scaring. There is suspense and fear in every corner of the screen and you will give some jerks just because of a sudden sound of a blinking neon lamp in the back of you. (In my opinion the sound editor did the best job in this movie.)When Kate meet her pursuer the quality of the movie drops but it still doesn't become a bad movie. The second part of the movie is not scary at all, but the gore effects are well done and the story is quite well developed. (...as long as you keep in mind that it is a horror movie you are watching and not the Discovery Channel!) So, if you want to make yourself a very, very scaring hour. Just watch the first hour of \"Creep\" and then leave the cinema or turn of your TV. You know the rest of the story anyway, don't you? The bad guy will die and Kate will be the only survivor. But even if you watch this movie up to its end, you will not be disappointed....and if you want to push anxiety to the next level, do what I did after watching this movie: leave the cinema by dark night, go to the next subway station and take the last train home...","title":"Creep (2004)","mpaa":"R","length":"1h 25min","genre":"Horror, Mystery, Thriller","release_date":"28 January 2005 ","avg_rating":"5.6","review_count":"28402","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.8cb63c2e-4103-0080-a811-8919fc06ec1c?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNTgzODgyOTQ3OF5BMl5BanBnXkFtZTcwMjI0MjgyMQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"43","raw_data_id":"2076","link":"http:\/\/www.imdb.com\/title\/tt0028944","txt_file_id":"2076_9","rating":"9","review":"The Good Earth is a great movie!!!Everybody must see...It is tear-jerking and very heart warming. It caters to the enhancement of values-formation on perseverance, humility and the love of family...The story can be related to our life today especially that poverty is at the threshold. The way on how we respond to such problem is very crucial and if a person is not strong enough to face such, he may be left defenseless and useless. I am very pleased on how the characters justified their roles even the young actors...Their emotions has captivated the audience. The movie may have been done in black and white, but the story is so captivating that you do not want to end. That makes it really great! There should be a re-make for this very nice movie.","title":"The Good Earth (1937)","mpaa":"Passed","length":"2h 18min","genre":"Drama, Romance","release_date":"6 August 1937 (U","avg_rating":"7.5","review_count":"4541","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.e0a9f797-9f3e-1066-21d4-8d3fd916ff5c?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNTM4NTczZWEtMTRhNi00YmRmLWE5ZDMtNjE2NGM0NDAwMjc2XkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"44","raw_data_id":"2102","link":"http:\/\/www.imdb.com\/title\/tt0808339","txt_file_id":"2102_10","rating":"10","review":"When I sat down to watch 'Largo Winch' I expected nothing more than action scenes and fascinating cars. When I stood up, I've seen both of these; and more.Karl Roden was finally not the antagonist in a movie, to start with. Kristin Scott Thomas played her role well, but the real two stars in my opinion were Tomer Sisley and Miki Manojlovic, both acting superbly. In Radivoje Bukvic portrayed Goran well.The mixed linguistics brought a nice color to the movie, but I understand why people would get bored with it.The scenery of Hong Kong and especially the stunning Croatian seaside both amazed me, and I hardly wanted to take my eyes off the screen when Largo entered the unbelievably beautiful island.Rolls Royce Phantom; Mercedes S500, and BMW 7; if anyone loves expensive limousine - type cars; this is their movie. It is also a movie for people who love action sequences, good acting, landscapes of extremal beauty, and above all, a fast - paced, well written action movie, with dazzling combat and a thoroughly twined inner drama.My vote, as it has enlightened a gloomy day is: 10\/10","title":"The Heir Apparent: Largo Winch (2008)","mpaa":"Not Rated","length":"1h 48min","genre":"Action, Thriller","release_date":"17 December 2008","avg_rating":"6.5","review_count":"13593","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.88a9f73b-e665-177f-728d-76a43fcfed40?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjI2MTY4OTkwOV5BMl5BanBnXkFtZTcwNzg2NjM5Ng@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"45","raw_data_id":"2106","link":"http:\/\/www.imdb.com\/title\/tt0033045","txt_file_id":"2106_10","rating":"10","review":"Would that more romantic comedies were as deftly executed as this one? I never thought anything as mundane as the simple sale of a music box could leave me catching my breath with excitement. Margaret Sullavan makes a marvellous saleswoman, and she and James Stewart always brought out the best in each other. This movie sports what I think is Frank Morgan's most winning performance, and with \"The Wizard of Oz\" and \"Tortilla Flat\" under his belt, that is saying a lot. The way he finds a Christmas dinner partner left me giddy with joy. Director Ernst Lubitsch might have thought \"Trouble In Paradise\" his favorite, but this one he must surely consider a triumph. With some of the wittiest dialogue American movies of the 30's has to offer.","title":"The Shop Around the Corner (1940)","mpaa":"Not Rated","length":"1h 39min","genre":"Comedy, Drama, Romance","release_date":"12 January 1940 ","avg_rating":"8.1","review_count":"28896","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.cca9f741-7eb5-486f-197c-3f254a531803?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNzc1MTcyNTQ5N15BMl5BanBnXkFtZTgwMzgwMDI0MjE@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"46","raw_data_id":"2172","link":"http:\/\/www.imdb.com\/title\/tt0048190","txt_file_id":"2172_7","rating":"7","review":"`Mad Dog' Earle is back, along with his sad-sack moll Marie, and that fickle clubfoot Velma. So are Babe and Red, Doc and Big Mac, and even the scenery-chewing mutt Pard. The only thing missing is a good reason for remaking Raoul Walsh's High Sierra 14 years later without rethinking a line or a frame, and doing so with talent noticeably a rung or two down the ladder from that in the original. (Instead of Walsh we get Stuart Heisler, for Humphrey Bogart we get Jack Palance, for Ida Lupino Shelley Winters, and so on down through the credits.) The only change is that, this time, instead of black-and-white, it's in Warnercolor; sadly, there are those who would count this an improvement.I Died A Thousand Times may be unnecessary  and inferior  but at least it's not a travesty; the story still works on its own stagy terms. Earle (Palance), fresh out of the pen near Chicago, drives west to spearhead a big job masterminded by ailing kingpin Lon Chaney, Jr.  knocking over a post mountain resort. En route, he almost collides with a family of Oakies, when he's smitten with their granddaughter; the smiting holds even when he discovers she's lame. Arriving at the cabins where the rest of gang holes up, he finds amateurish hotheads at one another's throats as well as Winters, who throws herself at him (as does the pooch). Biding time until they get a call from their inside man at the hotel, Palance (to Winter's chagrin) offers to pay for an operation to cure the girl's deformity, a gesture that backfires. Then, the surgical strike against the resort turns into a bloodbath. On the lam, Palance moves higher into the cold Sierras....It's an absorbing enough story, competently executed, that lacks the distinctiveness Walsh and his cast brought to it in 1941, the year Bogie, with this role and that of Sam Spade in the Maltese Falcon, became a star. And one last, heretical note: Those mountains do look gorgeous in color.","title":"I Died a Thousand Times (1955)","mpaa":"Passed","length":"1h 49min","genre":"Crime, Drama, Film-Noir","release_date":"9 November 1955 ","avg_rating":"6.4","review_count":"942","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.32a9f74a-ace4-b22a-7f6b-f1b25886dafb?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOGMzNzgzOTEtMjE0Yy00NmYwLWIzZTktMzczOTNmODA1ZjQ2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"47","raw_data_id":"2196","link":"http:\/\/www.imdb.com\/title\/tt0029626","txt_file_id":"2196_8","rating":"8","review":"... so what's in those missing 10 minutes that were so horrible they had to cut them out from the original film? We were three years into the film production code... Barbara Stanwyck had starred in the original play, but here, Carole Lombard plays Maggie King. Co star Fred MacMurray is probably best known for \"Double Indemnity\", with Stanwyck, as well as his hit TV show \"My Three Sons\". Keep an eye out for a young Dorothy Lamour (Bob Hope movies) and the too-fabulous Franklin Pangborn, who spiced up just about every film put on tape. Of course, he works in the beauty salon on the ship! Add the sublime Charles Butterworth and Anthony Quinn. Good timing and clever banter at the beginning. Maggie's buddy Ella is played by Jean Dixon, who was the best friend in \"Holiday\" and \"My Man Godfrey\". In \"Swing High\", Maggie the tourist meets a soldier who is leaving the army. Maggie misses her boat when it leaves port and gets tangled up with the soldier. The dashing 20-something Quinn has a small scene at the local bar in Panama where Johnson (MacMurray) has been playing the trumpet. Maggie, Harry (Butterworth), and Skid band together and try to figure out how to get back to the States. Some good singing by Lamour. Good (but brief) acting performance by Cecil Cunningham as \"Murph\", the wise, helpful owner of the local saloon in Panama. While others have lamented at how bad it is, it wasn't so awful, and is even a little exotic, with the fake Central America locale setting for the first half of the film.","title":"Swing High, Swing Low (1937)","mpaa":"Passed","length":"1h 32min","genre":"Comedy, Drama, Musical","release_date":"12 March 1937 (U","avg_rating":"6.2","review_count":"660","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.38a9f701-6c62-44b5-b5c6-4d1e78179116?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNTZjMTNmODYtYjFlNC00OGU5LTg4MTAtNDEzYTc0ZjM1MWNlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_UY268_CR15,0,182,268_AL_.jpg","notes":""},
{"s_no":"48","raw_data_id":"2263","link":"http:\/\/www.imdb.com\/title\/tt0117093","txt_file_id":"2263_10","rating":"10","review":"I felt drawn into the world of the manipulation of mind and will at the heart of the story. The acting by Nolte, Lee, Arkin and the supporting cast was superb. The strange twists in the Vonnegut story are made stranger by odd details.","title":"Mother Night (1996)","mpaa":"R","length":"1h 54min","genre":"Drama, Romance, War","release_date":"1 November 1996 ","avg_rating":"7.1","review_count":"3934","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.baacdc7c-b66e-a210-b911-c1761a5fa681?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOTgxZGU4MjktMmFhMi00N2U4LWE5ZWUtZTVhZWE1ZTBkMzI4XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"49","raw_data_id":"2301","link":"http:\/\/www.imdb.com\/title\/tt0102388","txt_file_id":"2301_10","rating":"10","review":"Really...and incredible film that though isn't very popular...extremely touching and almost life altering...was for me at least.Definitely worth seeing and buying .....Added to my favorite movie list....it's number one now....This is a very touching movie that all people should see..The Man in the Moon.....we'll it's just incredible. It's now my favorite movie and I only saw it today and I'd recommend it to anyone above 15 as long as you're somewhat mature......If you don't really try to feel the characters emotions then you'll never get the true meaning and value of this movie....But it really is incredible....just watch it because it'll alter the way some people look at life....worth seeing 5\/5","title":"The Man in the Moon (1991)","mpaa":"PG-13","length":"1h 39min","genre":"Drama, Romance","release_date":"4 October 1991 (","avg_rating":"7.4","review_count":"15604","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.ceb334c0-f699-e23f-b91b-19d4e4eca414?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BY2U1NjljOTgtNDE2My00OWI2LThmMTctMTAwNThkYmNhNzA3XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"50","raw_data_id":"2417","link":"http:\/\/www.imdb.com\/title\/tt0085603","txt_file_id":"2417_9","rating":"9","review":"\"Going Berserk\" is actually one of the funniest Candy films I have ever seen, period. Sure, it's kinda low budget, but it's a non-stop comedic tour de force. There are tons of memorable quotes. For instance, when his soon-to-be father-in-law asks him how much he earns, Candy says \"Oh, I pull down anywhere between thirty and...eleven thousand dollars a year, sir.\" Oh course, it is Candy's delivery that sells it. Just classic stuff. Eugene Levy also turns in a hilarious performance as a sleazy filmmaker. A clip of his horrible low budget movie \"Kung Fu U\" will have you rolling.So if you are a Candy fan and want to rediscover a forgotten gem, I can't recommend this movie enough.","title":"Going Berserk (1983)","mpaa":"R","length":"1h 25min","genre":"Comedy","release_date":"30 September 198","avg_rating":"5.3","review_count":"1665","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.3ea9f77e-dff8-2a45-a296-6430232f6b48?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMzZhNmNhN2UtMmE5Yy00NTMzLWFjZWEtYmVjNjY4ZWQ4ZDk2L2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"51","raw_data_id":"2461","link":"http:\/\/www.imdb.com\/title\/tt0116477","txt_file_id":"2461_10","rating":"10","review":"Kenneth Branagh's \"Hamlet\" hits all the marks. The acting is magnificent, the 70mm cinematography is gorgeous, the Oscar-nominated costumes and sets are stunning, and Patrick Doyle's score (also Oscar-nominated) is sensitive and moving. Oh yeah - the screenplay, by some guy named Will S., isn't too bad either. Film critics ribbed Branagh for receiving the films' fourth Oscar nod for \"adapting\" the screenplay, but his decision to use the full text was a gutsy one. I can't think of many better ways to make four hours fly by.Nearly every decision Branagh makes works brilliantly: the use of England's Blenheim Palace for exteriors, the Edwardian dress, and the staging of \"To be or not to be\" in a hall of mirrors, to name a few. The casting of Hollywood luminaries such as Robin Williams, Billy Crystal and Jack Lemmon in minor parts can be distracting, but that's nitpicking. The principal cast excels: Derek Jacobi captures the conflicted nature of Claudius; Kate Winslet acutely depicts Ophelia's descent into madness; Julie Christie brings passion to her portrayal of Gertrude; Richard Briers is pitch-perfect as the conniving Polonius; and Nicholas Farrell elevates the potentially thankless role of Horatio to the apotheosis of true friendship. Every speech, every line, every word is delivered with passion and conviction; there isn't a wasted moment in the entire film. The final scenes magnify the extent of Shakespeare's tragedy in a way not possible with theatrical adaptations.Branagh's \"Hamlet\" is a bold, ambitious, and ultimately successful attempt to match the grandeur and poetry of Shakespeare's language with equally eloquent imagery. It's arguably the greatest Shakespearean adaptation ever filmed  strong praise, but well deserved.","title":"Hamlet (1996)","mpaa":"PG-13","length":"4h 2min","genre":"Drama","release_date":"25 December 1996","avg_rating":"7.7","review_count":"36246","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.4ea9f73f-16fd-a5fc-482d-2c9fdf9da1d5?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BM2U5OWM5NWQtZDYwZS00NmI3LTk4NDktNzcwZjYzNmEzYWU1XkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_UY268_CR1,0,182,268_AL_.jpg","notes":""},
{"s_no":"52","raw_data_id":"2576","link":"http:\/\/www.imdb.com\/title\/tt0044091","txt_file_id":"2576_8","rating":"8","review":"I am of \"the Christopher Reeve Generation\" it is fair to say that he was the best actor to play Superman yet, but that doesn't stop me from enjoying other actors in the role, and George Reeves makes a pretty good bid to knock Chris off the top, though he just barely falls short. That doesn't stop me from enjoying this film, it has a lot going for it. It has all that a movie needs, a plot with beginning, middle, and end, plus all those parts are intelligently written. The film is edgy both in acting and storyline, something a film-noir but with tights. The story is both exciting and meaningful, this is a movie with a message that isn't too preachy. I am still amazed this was shot over 12 days, oh the glory days of Hollywood, when we didn't have to wait 5 years just to see if the movie would fall into development hell... The film is polished and expertly made, directed by Lee \"Roll'em\" Sholem, best known for directing with both speed and efficiency. It never lets the constraints of technology slow it down, in fact there is some creative things done to create the effect of flight, including putting a camera on a boom on a truck and shooting high and traveling fast to make it look like we are seeing it from Superman's point of view, also a few closeups of George in process work, and a long shot of an animated Superman. This is now available on DVD as an extra feature on the first season of the George Reeves Television series. A DVD worth owning in its own right, the inclusion of the film as its original whole, is icing on the cake.Give Blood Today God Bless!","title":"Superman and the Mole-Men (1951)","mpaa":"Passed","length":"58min","genre":"Action, Adventure, Drama","release_date":"23 November 1951","avg_rating":"5.7","review_count":"1790","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.fab8591c-3418-e22d-9b94-78dabc4443f8?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYTI0MTVlNmUtYjg0MC00OWNkLTgzMjUtZDNiZTJkYzA5NzA2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"53","raw_data_id":"2581","link":"http:\/\/www.imdb.com\/title\/tt0075950","txt_file_id":"2581_8","rating":"8","review":"People are being too hard on the film. Sometimes we should just sit back and enjoy the story without attempting to \"review\" it.The whole thing comes together when Hackman decides not to pull the trigger but his target still goes down. Then the fun begins as everyone about him also \"go down\".Just think JFK and all the people associated in any way with his assassination, who's lives ended abruptly and in questionable ways and you'll appreciate what is implied in this film.I think it's an excellent interpretation of what may well have occurred. Though the EXACT story line my not have been followed (hindsight here after reading Jim Maars \"Crossfire\") but it's what is implied that is of interest.I'd love to get a copy of it to view it again. In light of what is known today, The Domino Principle is right on.","title":"The Domino Principle (1977)","mpaa":"R","length":"1h 40min","genre":"Drama, Thriller","release_date":"20 March 1978 (U","avg_rating":"5.7","review_count":"2192","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.66b19171-a4ba-33fc-5fde-f8c7826a1268?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNmM4N2FkZmUtMDMxMy00ZmQ1LTk5OGMtYTkzMmE5ZDExY2RjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_UY268_CR10,0,182,268_AL_.jp","notes":""},
{"s_no":"54","raw_data_id":"2679","link":"http:\/\/www.imdb.com\/title\/tt0062032","txt_file_id":"2679_8","rating":"8","review":"Delirious, near plot-less mood piece and if it's more LSD inspired than the Devil then we must remember when it was made! After a startling SM opening (which even itself is not what it seems) we move to soft focus and dream or imaginings or remembering. Lots of literary and cinematic references and indeed this is the Franco film that Lang himself praised. Beautiful and mesmerising the film unfolds at a leisurely pace but has a richness within each fold. A rare movie to languish within. Old Jess could make 'em when he tried. Fine central performances too including the indomitable Jack Taylor and Howard Vernon. I haven't even mentioned the Lisbon locations - ah!","title":"Succubus (1968)","mpaa":"X","length":"1h 19min","genre":"Horror","release_date":"7 April 1969 (US","avg_rating":"5.4","review_count":"999","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.5aaff823-989c-317b-7f7b-c27878ec35a4?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNzQzOWFmZDItMTdlZS00ZGVkLTljN2EtMjg4NmY0ZmZmNmIwXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_UY268_CR2,0,182,268_AL_.jpg","notes":""},
{"s_no":"55","raw_data_id":"2686","link":"http:\/\/www.imdb.com\/title\/tt0111403","txt_file_id":"2686_9","rating":"9","review":"La Teta y la Luna is a symbolic spain film. Everything that in this film occurs has a symbolic meaning. It is totally different to the usual movie that one has access.This film is good but it will be good only for the people who want look for the meaning of everything in the film's tale. I must advice that this is not a sample film.Please enjoy!!!","title":"The Tit and the Moon (1994)","mpaa":"R","length":"1h 30min","genre":"Comedy, Romance","release_date":"29 March 1995 (F","avg_rating":"6.4","review_count":"2927","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.9ab2c93d-73f5-0b9f-4fc9-bcacd0a1023a?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZjcwNTE2YzgtNjM0OC00MzA3LTg3ZjctYzkwYmJhNTBhY2FmXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_UY268_CR3,0,182,268_AL_.jpg","notes":""},
{"s_no":"56","raw_data_id":"2699","link":"http:\/\/www.imdb.com\/title\/tt0118608","txt_file_id":"2699_10","rating":"10","review":"There are other reviews here so I don't need to say how great it is or what it's about...My point is: I heard about this movie ages ago, before it was shown. I can't even remember HOW, I just know it was through the internet. The distributors went under before it ever hit! For months I moped and complained. Please note that on this page there's a link to buy this film and the only highlighted area is VHS at Amazon.com in Germany. You can use Alta Vista's Babelfish to translate. I know it's PAL format and they DID change the text on the screen to German and there's a tiny little bit of narration at the beginning that's also been dubbed in German, but as hilarious and campy as this film is, it really only makes it funnier! If you want to see this movie and you have a place nearby that does conversions it's SO worth it! It cost about twenty dollars or so to get to the U.S. from Germany. Trust me, it might seem like a lot to spend on a film, but if you're into corny b-flicks you'll be blowing money left and right getting conversions for your friends!","title":"Amnesia (1997)","mpaa":"R","length":"1h 28min","genre":"Thriller","release_date":"7 June 1997 (USA","avg_rating":"4.5","review_count":"258","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.b4ba83e5-f229-3373-018e-e24047b07911?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTIzNzcyMjQ5OV5BMl5BanBnXkFtZTcwMzE4MjYyMQ@@._V1_UY268_CR2,0,182,268_AL_.jpg","notes":""},
{"s_no":"57","raw_data_id":"2709","link":"http:\/\/www.imdb.com\/title\/tt0071266","txt_file_id":"2709_8","rating":"8","review":"To finally see what many consider to be the greatest women-in-prison film of all time, I felt like I had accomplished something as ridiculous as that sounds. Boy, it sure contained the elements I expected, and delivered so much more. A constant I'm discovering in these films is the toughness and grit of the actresses in the roles of prisoners preparing for escape while their threshold, tolerance, and resolve(..not to mention sanity)being tested by their superiors. While most of them were hired for the way they look naked, because the nature of the genre demands such gratuitous elements, something else emerges, other attributes, such as attitude and guts, that I ultimately respond to.This, as you may know all too well, was Demme's debut for his mentor Roger Corman, and he provides the target audience with exactly what they desire while putting his own stamp on the proceedings. For instance, there are bizarre dreams certain characters have which define their current psychological states(..there's a particular number featuring warden Barbara Steele where she reminded me of Alex de Large of A Clockwork Orange).The film has female prisoners planning a daring escape, tired of the crazed antics of their wheel-chair bound warden and her nutty prison doc, Randolph(Warren Miller). Juanita Brown is Maggie, the tough, sassy sister who is fed up with the environment and will do whatever it takes to get out. She's the one all the girls fear to cross. Erica Gavin is Jacqueline Wilson, the newest prisoner who was busted by police and sentenced for the murder of a cop, unwilling to give up the names of those she was involved with. Roberta Collins is Belle, a serial kleptomaniac, best pals with Pandora(Ella Reid). Belle becomes the obsession of Randolph who promises Superintendent McQueen(Steele)that through a surgical procedure he can remove her violent tendencies. Drugging her up, Randolph takes nude pictures and sodomizes her, whimpering like a little girl due to his own mental deficiencies while hugging her naked body in his arms. Cheryl Rainbeaux Smith is Lavelle, in prison for life for murdering a scumbag who","title":"Caged Heat (1974)","mpaa":"R","length":"1h 23min","genre":"Action, Comedy, Drama","release_date":"14 June 1975 (Ja","avg_rating":"5.3","review_count":"2311","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.dcb2369c-cd5e-baa1-c860-3a082e2f205e?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZGY2YzliN2ItYzM1MS00MjVlLWFhNDYtODE1NzI2ZjJmYjdjL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"58","raw_data_id":"2719","link":"http:\/\/www.imdb.com\/title\/tt0061809","txt_file_id":"2719_10","rating":"10","review":"I saw this film after watching Capote and Infamous. It is just incredible how the homosexual relationships between author and protagonists are sublimated in the movie. The reporter is straight, the protagonists are more beatniks than gay.The film starts slowly, but on reviewing it a second time, we get all sorts of interesting information from similes that the writer\/director Brooks creates.Notice the incredible cutting at the beginning where killers and to-be-killed are linked. Cutter on the phone is matched-cut to Perry on the phone. Cutter washing his face is matched-cut to Perry washing his face. Only Perry's looking in the mirror and seeing his eroticized male body sets off a fantasy of his playing a guitar in Las Vegas to empty chairs. This failure\/fantasy matches the failure-fantasy that Perry tells us about his father who built a beautiful motel in Alaska only to find it perpetually empty.Dick talks about shooting pheasants and the fact that the pheasants don't know that that they're going to die. we cut to the Clutters.Perry talks his dream about a yellow bird, \"Taller than Jesus\" who attacks the Nuns who have persecuted them. \"The Nuns begged for mercy,\" he tells us, \"But the bird slaughtered them anyway.\" The bird lifted Perry to paradise. Strangely, Perry says that he has an aversion to Nuns, God and Religion. This echoes later in his last words when he wants to apologize but does not know to whom.The director puts in all sorts of what-ifs and only-ifs.Nancy Cutter gets an offer to sleep at a friends house. She is holding a horse. Perry will comment on a picture of her and the house later on. Nancy can't sleep over at her friends' house because her boyfriend is coming over for dinner. The decision seals her fate.Perry talks of Bogart in \"Treasure of Sierra Madre\". But it is another Bogart picture, \"Beat the Devil\" which Truman Capote co-wrote, where a fictional treasure hunt is the McGuffin. But Dick knows that the protagonists of that film ended up with nothing. Dick wants the hard cash, the $10,000 he thinks is in the Clutter's safe, (which ironically turns out to be as much as a fan","title":"In Cold Blood (1967)","mpaa":"R","length":"2h 14min","genre":"Biography, Crime, Drama","release_date":"15 December 1967","avg_rating":"7.8","review_count":"24438","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.bea9f7a2-25ac-a357-2b4c-cd250244d91b?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOTg4OGY2NmEtZTZlMy00ZjM3LWIyZjAtMzQzMjI1MmI1OTRhL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"59","raw_data_id":"2768","link":"http:\/\/www.imdb.com\/title\/tt0043455","txt_file_id":"2768_8","rating":"8","review":"Other than Susan Hayward's wooden delivery throughout this film it was as good as any biblical film made. Henry King handles this film with the respect of an epic in all of the small scenes, and Peck is, as always, impeccable. The stirring Alfred Newman sound score, with the stirring twenty-third psalm is unforgettable even after these many years. The scene with Goliath is a bit on the hokey side, but not all that badly done for the era in which this film was made. This goes well alongside the lesser bible epics of the day, \"The Song of Ruth\" and \"Esther and the King.\" It is worth watching, and Raymond Massy is excellent as the prophet Nathan. The film is rounded out by the always fine James Robertson Justice as Abishai and Jayne Meadows as Michol, David's estranged first wife.","title":"David and Bathsheba (1951)","mpaa":"Approved","length":"1h 56min","genre":"Drama, History, Romance","release_date":"10 August 1951 (","avg_rating":"6.1","review_count":"2144","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.58a9f784-79e3-c16b-faf8-f5dca1c9a388?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BZTFmZmZlZDEtMGY0ZC00YmQwLTg5YzYtY2VkYjIxYjhhZmEwXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"60","raw_data_id":"2779","link":"http:\/\/www.imdb.com\/title\/tt0286499","txt_file_id":"2779_7","rating":"7","review":"To \"Bend It Like Beckham\" may not mean much to us Americans who know very little about the other football (soccer), but to English sports fans, it is equivalent to \"Hit it Like Bonds\" or \"Dunk it Like Jordan.\" Any young soccer player dreams of bending a soccer ball around one player and into the net for a goal, much like star player David Beckham does, much like the young Indian girl, Jess (Parminder Nagra), does in the film Bend It Like Beckham. Jess loves to play pick up soccer games, the kind forbidden by her traditionalist mother. However, while playing one day, a passing friend named Jules (Keira Knightley) sees her play and invites her to try out for a traveling, all girls soccer team. After satisfying the coach Joe (Jonathan Rhys-Meyers), she makes the team, something she knows her mother would not approve of. The movie is not about disobeying parents, but rather a girl doing what she wants to do, even if that goes against culture, not just the parents. There is humor thrown throughout the movie, especially when Jules' mother thinks she's a lesbian. The movie does resort to a bit of a cliché moment, as the big soccer game is the same day as Jess' sister's wedding, but it does not come off a cheesy, but rather fun and light. The soccer action looks good, so sports fans will enjoy it, and a story about girls growing up in a boy's world, the world of soccer will inspire some in the audience. Bend It Like Beckham is not just about soccer, but rather a girl trying to find herself and please her parents at the same time, something that proves to be rather difficult.","title":"Bend It Like Beckham (2002)","mpaa":"PG-13","length":"1h 52min","genre":"Comedy, Drama, Romance","release_date":"1 August 2003 (U","avg_rating":"6.6","review_count":"105149","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.10a9f73b-b934-8383-f6b0-4e10b9d21d37?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTg1Njk5NjczM15BMl5BanBnXkFtZTYwNjc2NTQ3._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"61","raw_data_id":"2837","link":"http:\/\/www.imdb.com\/title\/tt0101004","txt_file_id":"2837_8","rating":"8","review":"Bored and unhappy young babe Zandalee (a winningly sultry and vibrant performance by luscious brunette knockout Erika Anderson) feels trapped in a stale and loveless marriage to failed poet and decent, yet dull businessman Thierry Martin (a solid and credible portrayal by Judge Reinhold). Zandalee has a torrid adulterous fling with sleazy and arrogant artist Johnny Collins (deliciously played to the slimy hilt by Nicolas Cage). Can the relationship between Thierry and Zandalee be salvaged? Or is everything going to fall apart and go to seed? Director Sam Pillsbury and screenwriter Mari Kornhauser lay on the tawdry soap opera-style histrionics something thick while attempting to tell a wannabe serious and insightful story about desire run amok and its potentially dangerous consequences; the plot goes gloriously off the rails in the laughably histrionic last third. The dialogue is likewise hilariously silly and vulgar (sample line: \"I wanna shake you naked and eat you alive\"). Better still, this flick certainly delivers plenty of tasty female nudity (the gorgeously statuesque Anderson looks smoking hot in the buff) and sizzling semi-pornographic soft-core sex scenes (Johnny and Zandalee doing the dirty deed in a church confessional booth rates as a definite steamy highlight). The tart'n'tangy New Orleans setting adds extra spice to the already steamy proceedings. With his long, scruffy black hair, greasy mustache, foul mouth, and coarse manners, Cage's Johnny is an absolute hoot as the single most grossly unappealing \"romantic\" lead to ever ooze his way onto celluloid. The cast deserve props for acting with admirable sincerity: Anderson, Cage and Reinhold all do respectable work with their parts, with fine support from Joe Pantoliano as Zandalee's merry flamboyant homosexual friend Gerri, Viveca Lindfors as Theirry's wise, perceptive mother Tatta, Aaron Neville as friendly bartender Jack, and Steve Buscemi as a funny, blithely shameless thief. Walt Lloyd's sharp and gleaming cinematography gives the picture an attractive glossy look. The flavorsome, harmonic score by Pray for Rain likewise hits the ","title":"Zandalee (1991)","mpaa":"R","length":"1h 40min","genre":"Drama, Romance, Thriller","release_date":"9 May 1991 (Germ","avg_rating":"4.4","review_count":"3473","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.bcb53f5a-ecda-9f1d-42b6-6ecab8c27cae?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNzg5ODRlMjMtYmExYi00Y2NlLThhNmEtNzlhNWYyZjg4MDk2XkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"62","raw_data_id":"2839","link":"http:\/\/www.imdb.com\/title\/tt0808399","txt_file_id":"2839_10","rating":"10","review":"I saw this movie at an advance screening and found it excellent.New York I Love You is a true spin on a romance that explores clever, funny, and sometimes shocking situations around the human race's most powerful emotion.The cast is huge, a veritable Oceans 11 with Andy Garcia, Ethan Hawke, Shia Labouf, Natalie Portman, Bradley Cooper and others. They all give stand out performances in one way or another.That's not to mention that there is a who's who of directors interweaving stories in clever and interesting ways. Brett Rattner, Shaka Kapur, Natalie Portman, I mean -WOW! This movie is not a straight ahead romance or romantic comedy even though it is both romantic and funny. It also has serious stories and notes. But that's good in my opinion. Go see it for yourself and reply to my review, I want to hear what others have to say.","title":"New York, I Love You (2008)","mpaa":"R","length":"1h 43min","genre":"Comedy, Drama, Romance","release_date":"16 October 2009 ","avg_rating":"6.2","review_count":"45020","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.b2b0bb9f-0010-94d7-45f0-a69d33bc894d?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTI3NDYxOTM4OF5BMl5BanBnXkFtZTcwOTEwNTI4Mg@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"63","raw_data_id":"2918","link":"http:\/\/www.imdb.com\/title\/tt0078034","txt_file_id":"2918_9","rating":"9","review":"...I saw this on cable back in the late 1980's as I was a big wrestling fan since 1986. I saw this on VHS in a 'for sale' bin and bought it.In 1998, I started training as a wrestler after the Air Force and would always go back to watching this to see how it was a very accurate portrayal of people that are involved with wrestling ( families and friends that wouldn't understand us, the travel, the heartbreak, etc. ). Henry Winkler is funny and sometimes sad to watch as nobody else can understand what a genius he is creatively. A great way to separate himself The Fonz character he played on Happy Days at the time. Plus, look at the cast...William Daniels ( Knight Rider ), Polly Holiday ( Alice ), and wrestlers Roddy Piper and Chavo Guerrero Sr. If you get a chance, watch it.","title":"The One and Only (1978)","mpaa":"PG","length":"1h 37min","genre":"Comedy, Romance","release_date":"3 February 1978 ","avg_rating":"5.8","review_count":"681","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.0ca9f7b8-1a58-e25d-a28b-62423b819eb8?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMmI2OTE4MGUtYzgyYS00MDg4LWIyZTUtYTI2YWFmYmFiZjMwXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"64","raw_data_id":"2958","link":"http:\/\/www.imdb.com\/title\/tt0249376","txt_file_id":"2958_10","rating":"10","review":"A comedy of epically funny proportions from the guys that brought you South Park, and most of the guys from Orgazmo. This vulgur, obscence movie has utterly disgusting, eggotistical, and satirical content. It portrays incredibly cruel treatment of humans and animals. I LOVE IT!!!!! This is some funny stuff. Really funny. Two loser friends create a game in thier driveway, which explodes into a national sensation. Corruption and greed and blackmail turn the sport sour, and its up ta Coop ta fix it. And along the way, you will laugh. Alot. That's all there is. Enjoy!!!!","title":"BASEketball (1998)","mpaa":"R","length":"1h 43min","genre":"Comedy, Sport","release_date":"31 July 1998 (US","avg_rating":"6.5","review_count":"57274","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.62a9f77f-462f-99b5-5bd3-2b8bba050f55?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMmZjZDg2ZjItYTVkNC00YWRmLThmZTMtNTYxNTI5MWM4NjU4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"65","raw_data_id":"2994","link":"http:\/\/www.imdb.com\/title\/tt0024210","txt_file_id":"2994_8","rating":"8","review":"whereas the hard-boiled detective stories of Dashiell Hammett and Raymond Chandler have fitted to cinema like a fox in a chicken coop - indeed creating the definitively modern American genre and style in the process - those of what might be called Golden Age fiction have made barely any impression whatsoever. The problem with books like those of Agatha Christie, Dorothy L. Sayers or S.S. Van Dine (on whose work this film is based), is that they are low on action or variety - whereas Sam Spade or Philip Marlowe traverse the mean streets of LA, working class tenements, bars, offices, wealthy mansions, and meet all sorts of exciting dangers and violence, Golden Age fiction is generally fixed in location, the scene of the murder, usually a lavish country house, and the action is limited to investigating clues and interviewing suspects. This is a very static procedure, plot reduced to puzzle.This, of course, is as much ideological as anything else, the Golden Age stories dealing with a society hostile to change and movement; the hard-boiled novels recording an urban reality increasingly moving away from a centre (both of authority, and of a city), dividing itself up into hostile, ever uncontrollable and lawless camps. Another major problem with Golden age fiction is character - because we cannot know the answer to the crime until the end, we cannot gain access to characters' motivations or emotions, being defined solely by their potential need to murder. The detective, unlike the anxious, prejudice-ridden private eyes, are simply there to be brilliant, and maybe a little eccentric.The problem with most films from Golden Age books is that they try to be period recreations of the Merchant Ivory\/Jane Austen school, and end up looking silly. There have been successes, for example the radical reworkings of Ellery Queen and others by Claude Chabrol. In the English-speaking world, there have really only been two. The Alistair Sim classic, 'Green For Danger', works because it pushes the form almost into parody, while never betraying the integrity or interest of the mystery.Before that came Michael Curtiz's bri","title":"The Kennel Murder Case (1933)","mpaa":"Passed","length":"1h 13min","genre":"Crime, Mystery","release_date":"28 October 1933 ","avg_rating":"6.9","review_count":"3180","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.8eb146a5-5788-50c9-eafa-bafe34d3e2d1?ref_=imdbref_tt_wbr_pvs_piv&tag=imdbtag_tt_wbr_pvs_piv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTQ5ODQ2MzU2NF5BMl5BanBnXkFtZTgwNjczNzkxMjE@._V1_UY268_CR1,0,182,268_AL_.jpg","notes":""},
{"s_no":"66","raw_data_id":"3021","link":"http:\/\/www.imdb.com\/title\/tt0061858","txt_file_id":"3021_8","rating":"8","review":"but it's worth watching for Boyer, Lorre and Paxinou. Greene's entertainments that were filmed during the war either required transplanting to American shores, as in This Gun for Hire, or the use of American actors in roles where they did not fit. Bacall fits that part here. I kept waiting for her to whistle and bring Bogie to life; her tone of voice is simply all wrong for an upper class Englishwoman. But listen to the dialogue! No, people don't talk that way except in books, but Greene was sending a message about an England that needed to wake up to the dangers of the world. One other positive note: Greene's range of characters were kept whole. While Mr. Mukerjee resembled more a Brahamin, at least his nationality was kept, and his final conversation with Paxinou is priceless.","title":"The Karate Killers (1967)","mpaa":"Approved","length":"1h 29min","genre":"Comedy, Crime, Thriller","release_date":"7 April 1967 (US","avg_rating":"5.1","review_count":"519","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.50a9f782-28f0-02bb-101e-3cc31a98e83e?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMTU2MjQ5OTg3OF5BMl5BanBnXkFtZTgwMTY5NzI1NjE@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"67","raw_data_id":"3022","link":"http:\/\/www.imdb.com\/title\/tt0037610","txt_file_id":"3022_7","rating":"7","review":"Never realized that Charles Boyer, (Luis Denard) appeared with Lauren Bacall,(Rose Cullen) in a film together and enjoyed their great acting together. Even Peter Lorre, (Contreras) had a role in this film and had a bad misfortune in his bathroom that caused him to faint. This story deals with a Republican Courier, Luis Denard who visits England during the Spanish Civil War and tries to disrupt a coal mining contract that will cause great harm to other nations. Lauren Bacall, (Rose Cullen) comes to the aid of Luis Denard by picking him up and at the same time falling in love with him and then proceeds to help him escape from an angry crowd of English Mine Workers who threaten his life. The real bad guy in this film is Victor Francen, (Licata) \"Beast with Five Fingers\" who gives an outstanding performance. Great Classic 1945 film without Humphrey Bogart.","title":"Confidential Agent (1945)","mpaa":"Passed","length":"1h 58min","genre":"Drama, Thriller","release_date":"10 November 1945","avg_rating":"6.5","review_count":"946","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.cea9f781-ed4c-3ce2-9aa1-b2534b4891f1?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNDU5NjBmMDEtNTk5ZS00YTQ4LWFlZTktZWE1MDU3NDkzMTExXkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""},
{"s_no":"68","raw_data_id":"3036","link":"http:\/\/www.imdb.com\/title\/tt0076342","txt_file_id":"3036_9","rating":"9","review":"Name just says it all. I watched this movie with my dad when it came out and having served in Korea he had great admiration for the man. The disappointing thing about this film is that it only concentrate on a short period of the man's life - interestingly enough the man's entire life would have made such an epic bio-pic that it is staggering to imagine the cost for production.Some posters elude to the flawed characteristics about the man, which are cheap shots. The theme of the movie \"Duty, Honor, Country\" are not just mere words blathered from the lips of a high-brassed officer - it is the deep declaration of one man's total devotion to his country.Ironically Peck being the liberal that he was garnered a better understanding of the man. He does a great job showing the fearless general tempered with the humane side of the man.","title":"MacArthur (1977)","mpaa":"PG","length":"2h 10min","genre":"Biography, Drama, History","release_date":"15 July 1977 (US","avg_rating":"6.6","review_count":"4348","prime_view_link":"https:\/\/www.amazon.com\/gp\/video\/detail\/amzn1.dv.gti.14a9f72e-ff45-de52-4a14-e6b74caa9218?ref_=imdbref_tt_wbr_pvt_aiv&tag=imdbtag_tt_wbr_pvt_aiv-20","image_link":"https:\/\/m.media-amazon.com\/images\/M\/MV5BNTRjMjYzNDEtMjNmNy00NzJiLWE0NDgtZDk1N2IzYjgzYTMwXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_UX182_CR0,0,182,268_AL_.jpg","notes":""}
]
}
]
